test_choices = [
    (1, 'Ухаживать за животными', 'Обслуживать машины'),
    (2, 'Помогать больным людям, лечить их', 'Составлять таблицы, схемы, программы для вычислительных машин'),
    (3, 'Участвовать в оформлении книг, плакатов,  журналов', 'Следить за состоянием и развитием растений'),
    (4, 'Обрабатывать материалы (древесину, ткань, металл, пластмассу и др.)', 'Доводить товары до потребителя (рекламировать)'),
    (5, ' Обсуждать научно-популярные книги, статьи', 'Обсуждать художественные книги (или пьесы, концерты)'),
    (6, 'Содержать животных', 'Тренировать товарищей (или младших школьников) в выполнении каких-либо действий (трудовых, учебных, спортивных)'),
    (7, 'Копировать рисунки, изображения (или настраивать музыкальные инструменты)', 'Управлять подъемным краном, трактором, тепловозом и т. п.'),
    (8, 'Сообщать (разъяснять) людям какие-либо сведения (в справочном бюро, на экскурсии)', 'Художественно оформлять выставки, витрины (или участвовать в подготовке пьес, концертов)'),
    (9, 'Ремонтировать вещи (одежду, технику), жилище', 'Искать и исправлять ошибки в текстах, таблицах, рисунках'),
    (10, 'Лечить животных', 'Выполнять вычисления, расчеты'),
    (11, 'Выводить новые сорта растений', 'Конструировать, проектировать новые виды изделий (машины, одежду, дома и т. п.)'),
    (12, 'Разрешать споры, предупреждать ссоры, убеждать, разъяснять, поощрять, наказывать', 'Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок)'),
    (13, 'Участвовать в работе кружков художественной самодеятельности', 'Наблюдать, изучать жизнь микробов'),
    (14, 'Налаживать медицинские приборы, аппараты', 'Оказывать людям медицинскую помощь при ранениях, ушибах и т. п.'),
    (15, 'Составлять точные описания, отчеты о наблюдаемых явлениях, событиях, измеряемых объектах и т.п.', 'Художественно описывать, отображать события (наблюдаемые или представляемые)'),
    (16, 'Выполнять лабораторные анализы в больнице', 'Принимать, осматривать больных, беседовать с ними, назначать лечение'),
    (17, 'Красить или расписывать стены или помещения, поверхность изделий', 'Осуществлять монтаж зданий или сборку машин, приборов'),
    (18, 'Организовывать культпоходы сверстников или младших товарищей (в театры, музеи), экскурсии, туристические походы и т. п.', 'Играть на сцене, принимать участие в концертах'),
    (19, 'Изготавливать по чертежам детали, изделия (машины, одежду), строить здания', 'Заниматься черчением, копировать чертежи, карты'),
    (20, 'Вести борьбу с болезнями растений, с вредителями леса, сада', 'Работать на клавишных машинах (пишущей машинке, телетайпе и др.)'),
]

prf_types = [
    ' «Человек—природа» — все профессии, связанные с растениеводством, животноводством и лесным хозяйством. ',
    ' «Человек—техника» — все технические профессии. ',
    ' «Человек—человек» — все профессии, связанные с обслуживанием людей, с общением. ',
    ' «Человек—знак» — все профессии, связанные с обсчетами, цифровыми буквенными знаками, в том числе и музыкальные специальности. ',
    ' «Человек—художественный образ» — все творческие специальности. '
]

pra_1 = [(1, 1), (3, 2), (6, 1), (10, 1), (11, 1), (13, 2), (16, 1), (20, 1)]
pra_2 = [(1, 2), (4, 1), (7, 2), (9, 1), (11, 2), (14, 1), (17, 2), (19, 1)] 
pra_3 = [(2, 1), (4, 2), (6, 2), (8, 1), (12, 1), (14, 2), (16, 2), (18, 1)]
pra_4 = [(2, 2), (5, 1), (9, 2), (10, 2), (12, 2), (15, 1), (19, 2), (20, 2)]
pra_5 = [(3, 1), (5, 2), (7, 1), (8, 2), (13, 1), (15, 2), (17, 1), (18, 2)]

prf_type_answers = [pra_1, pra_2, pra_3, pra_4, pra_5]

